function getTreeViewData() {                                                    //后台实际格式
    return {
        data: [{
            childCount: 7,
            nodeChildren: [
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "1",
                    nodeName: "用户管理",
                    nodeUrl: ""
                },
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "2",
                    nodeName: "菜单管理",
                    nodeUrl: ""
                },
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "3",
                    nodeName: "职位授权",
                    nodeUrl: ""
                },
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "4",
                    nodeName: "权限组管理",
                    nodeUrl: ""
                },
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "5",
                    nodeName: "权限组类型管理",
                    nodeUrl: ""
                },
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "6",
                    nodeName: "数据字典",
                    nodeUrl: ""
                },
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "7",
                    nodeName: "操作日志",
                    nodeUrl: ""
                }
            ],
            nodeId: "55123",
            nodeName: "基础配置管理",
            nodeUrl: ""
        },
            {
                childCount: 1,
                nodeChildren: [
                    {
                        childCount: 0,
                        nodeChildren: [],
                        nodeId: "1",
                        nodeName: "部门管理",
                        nodeUrl: ""
                    }
                ],
                nodeId: "6453",
                nodeName: "组织部门管理",
                nodeUrl: ""
            }],
        state: {
            code: 200,
            description: "成功"
        }
    }
}

function getTableHead() {
    return {
        data: [
            {
                field: '1',
                title: '时间'
            }, {
                field: '2',
                title: '物资名称'
            },
            {
                field: '3',
                title: '型号规格'
            }, {
                field: '4',
                title: '单位'
            }, {
                field: '5',
                title: '供应商'
            }, {
                field: '6',
                title: '可用数量'
            }, {
                field: '7',
                title: '锁定数量'
            }, {
                field: '8',
                title: '库存总数'
            }
        ],
        state: {
            code: 200,
            description: "成功"
        }
    }
}

function getInsertTableData() {
    return [{
        "1": "10002",
        "2": "哈哈哈哈",
        "3": "621234",
        "4": "官方设定集",
        "5": "结果",
        "6": "高峰时段",
        "7": "胡胖子麓小院替代",
        "8": "2019-07-09"
    }, {
        "1": "10002",
        "2": "哈哈哈哈",
        "3": "别说话",
        "4": "621234",
        "5": "胡胖子麓小院替代",
        "6": "告诉对方",
        "7": "换个地方",
        "8": "2019-07-09",
    }]
}

function getClientTableData() {
    return {
        data: [{
            "item": [{
                "id": "1",
                "value": "10001",
                "dataTime": "2019-07-09 18:00:00.0",
                "name": "终止值"
            }, {
                "id": "2",
                "value": "14561.783",
                "name": "起始值",
                "dataTime": "2019-07-09 06:00:00.0"
            }],
            "3": "621234",
            "4": "官方设定集",
            "5": "结果",
            "6": "高峰时段",
            "7": "胡胖子麓小院替代",
            "8": "2019-07-09"
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }],
        state: {
            code: 200,
            description: "查询成功"
        }
    }
}

var flagNumber = 0;
function getServerTableData() {
    flagNumber++;
    switch (flagNumber) {
        case 1:
            return {
                rows: [{
                    "1": "2019-07-05 09:53:39",
                    "2": "10331",
                    "3": "212265464",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "199809",
                    "7": "0",
                    "8": "湖南省长沙市芙蓉区1",
                    "9": "文和友老长沙龙虾馆",
                    "10": "1",
                    "stateName": "已开通",
                    "steelNumber": "434324422",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "DY080"
                }, {
                    "1": "2019-06-21 14:49:23",
                    "2": "71001",
                    "3": "863703031842698",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "400821",
                    "7": "0",
                    "8": "湖南省长沙市天心区文和友老长沙龙",
                    "9": "文和友老长沙龙虾馆",
                    "10": "863703031842698",
                    "stateCode": "1",
                    "stateName": "已开通",
                    "steelNumber": "180611042",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "BSS25-G40"
                }, {
                    "1": "2019-07-05 09:53:39",
                    "2": "10331",
                    "3": "212265464",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "199809",
                    "7": "0",
                    "8": "湖南省长沙市芙蓉区1",
                    "9": "文和友老长沙龙虾馆",
                    "10": "1",
                    "stateName": "已开通",
                    "steelNumber": "434324422",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "DY080"
                }, {
                    "1": "2019-06-21 14:49:23",
                    "2": "71001",
                    "3": "863703031842698",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "400821",
                    "7": "0",
                    "8": "湖南省长沙市天心区文和友老长沙龙",
                    "9": "文和友老长沙龙虾馆",
                    "10": "863703031842698",
                    "stateCode": "1",
                    "stateName": "已开通",
                    "steelNumber": "180611042",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "BSS25-G40"
                }, {
                    "1": "2019-07-05 09:53:39",
                    "2": "10331",
                    "3": "212265464",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "199809",
                    "7": "0",
                    "8": "湖南省长沙市芙蓉区1",
                    "9": "文和友老长沙龙虾馆",
                    "10": "1",
                    "stateName": "已开通",
                    "steelNumber": "434324422",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "DY080"
                }, {
                    "1": "2019-06-21 14:49:23",
                    "2": "71001",
                    "3": "863703031842698",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "400821",
                    "7": "0",
                    "8": "湖南省长沙市天心区文和友老长沙龙",
                    "9": "文和友老长沙龙虾馆",
                    "10": "863703031842698",
                    "stateCode": "1",
                    "stateName": "已开通",
                    "steelNumber": "180611042",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "BSS25-G40"
                }, {
                    "1": "2019-07-05 09:53:39",
                    "2": "10331",
                    "3": "212265464",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "199809",
                    "7": "0",
                    "8": "湖南省长沙市芙蓉区1",
                    "9": "文和友老长沙龙虾馆",
                    "10": "1",
                    "stateName": "已开通",
                    "steelNumber": "434324422",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "DY080"
                }, {
                    "1": "2019-06-21 14:49:23",
                    "2": "71001",
                    "3": "863703031842698",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "400821",
                    "7": "0",
                    "8": "湖南省长沙市天心区文和友老长沙龙",
                    "9": "文和友老长沙龙虾馆",
                    "10": "863703031842698",
                    "stateCode": "1",
                    "stateName": "已开通",
                    "steelNumber": "180611042",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "BSS25-G40"
                }, {
                    "1": "2019-07-05 09:53:39",
                    "2": "10331",
                    "3": "212265464",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "199809",
                    "7": "0",
                    "8": "湖南省长沙市芙蓉区1",
                    "9": "文和友老长沙龙虾馆",
                    "10": "1",
                    "stateName": "已开通",
                    "steelNumber": "434324422",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "DY080"
                }, {
                    "1": "2019-06-21 14:49:23",
                    "2": "71001",
                    "3": "863703031842698",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "400821",
                    "7": "0",
                    "8": "湖南省长沙市天心区文和友老长沙龙",
                    "9": "文和友老长沙龙虾馆",
                    "10": "863703031842698",
                    "stateCode": "1",
                    "stateName": "已开通",
                    "steelNumber": "180611042",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "BSS25-G40"
                }, {
                    "1": "2019-07-05 09:53:39",
                    "2": "10331",
                    "3": "212265464",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "199809",
                    "7": "0",
                    "8": "湖南省长沙市芙蓉区1",
                    "9": "文和友老长沙龙虾馆",
                    "10": "1",
                    "stateName": "已开通",
                    "steelNumber": "434324422",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "DY080"
                }, {
                    "1": "2019-06-21 14:49:23",
                    "2": "71001",
                    "3": "863703031842698",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "400821",
                    "7": "0",
                    "8": "湖南省长沙市天心区文和友老长沙龙",
                    "9": "文和友老长沙龙虾馆",
                    "10": "863703031842698",
                    "stateCode": "1",
                    "stateName": "已开通",
                    "steelNumber": "180611042",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "BSS25-G40"
                }, {
                    "1": "2019-07-05 09:53:39",
                    "2": "10331",
                    "3": "212265464",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "199809",
                    "7": "0",
                    "8": "湖南省长沙市芙蓉区1",
                    "9": "文和友老长沙龙虾馆",
                    "10": "1",
                    "stateName": "已开通",
                    "steelNumber": "434324422",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "DY080"
                }, {
                    "1": "2019-06-21 14:49:23",
                    "2": "71001",
                    "3": "863703031842698",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "400821",
                    "7": "0",
                    "8": "湖南省长沙市天心区文和友老长沙龙",
                    "9": "文和友老长沙龙虾馆",
                    "10": "863703031842698",
                    "stateCode": "1",
                    "stateName": "已开通",
                    "steelNumber": "180611042",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "BSS25-G40"
                }, {
                    "1": "2019-07-05 09:53:39",
                    "2": "10331",
                    "3": "212265464",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "199809",
                    "7": "0",
                    "8": "湖南省长沙市芙蓉区1",
                    "9": "文和友老长沙龙虾馆",
                    "10": "1",
                    "stateName": "已开通",
                    "steelNumber": "434324422",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "DY080"
                }, {
                    "1": "2019-06-21 14:49:23",
                    "2": "71001",
                    "3": "863703031842698",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "400821",
                    "7": "0",
                    "8": "湖南省长沙市天心区文和友老长沙龙",
                    "9": "文和友老长沙龙虾馆",
                    "10": "863703031842698",
                    "stateCode": "1",
                    "stateName": "已开通",
                    "steelNumber": "180611042",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "BSS25-G40"
                }, {
                    "1": "2019-07-05 09:53:39",
                    "2": "10331",
                    "3": "212265464",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "199809",
                    "7": "0",
                    "8": "湖南省长沙市芙蓉区1",
                    "9": "文和友老长沙龙虾馆",
                    "10": "1",
                    "stateName": "已开通",
                    "steelNumber": "434324422",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "DY080"
                }, {
                    "1": "2019-06-21 14:49:23",
                    "2": "71001",
                    "3": "863703031842698",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "400821",
                    "7": "0",
                    "8": "湖南省长沙市天心区文和友老长沙龙",
                    "9": "文和友老长沙龙虾馆",
                    "10": "863703031842698",
                    "stateCode": "1",
                    "stateName": "已开通",
                    "steelNumber": "180611042",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "BSS25-G40"
                }],
                total: 26,
                state: {
                    code: 200,
                    description: "查询成功"
                }
            };
        case 2:
            return {
                rows: [{
                    "1": "2019-07-05 09:53:39",
                    "2": "10331",
                    "3": "212265464",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "199809",
                    "7": "0",
                    "8": "湖南省长沙市芙蓉区1",
                    "9": "文和友老长沙龙虾馆",
                    "10": "1",
                    "stateName": "已开通",
                    "steelNumber": "434324422",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "DY080"
                }, {
                    "1": "2019-06-21 14:49:23",
                    "2": "71001",
                    "3": "863703031842698",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "400821",
                    "7": "0",
                    "8": "湖南省长沙市天心区文和友老长沙龙",
                    "9": "文和友老长沙龙虾馆",
                    "10": "863703031842698",
                    "stateCode": "1",
                    "stateName": "已开通",
                    "steelNumber": "180611042",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "BSS25-G40"
                }, {
                    "1": "2019-07-05 09:53:39",
                    "2": "10331",
                    "3": "212265464",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "199809",
                    "7": "0",
                    "8": "湖南省长沙市芙蓉区1",
                    "9": "文和友老长沙龙虾馆",
                    "10": "1",
                    "stateName": "已开通",
                    "steelNumber": "434324422",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "DY080"
                }, {
                    "1": "2019-06-21 14:49:23",
                    "2": "71001",
                    "3": "863703031842698",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "400821",
                    "7": "0",
                    "8": "湖南省长沙市天心区文和友老长沙龙",
                    "9": "文和友老长沙龙虾馆",
                    "10": "863703031842698",
                    "stateCode": "1",
                    "stateName": "已开通",
                    "steelNumber": "180611042",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "BSS25-G40"
                }, {
                    "1": "2019-07-05 09:53:39",
                    "2": "10331",
                    "3": "212265464",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "199809",
                    "7": "0",
                    "8": "湖南省长沙市芙蓉区1",
                    "9": "文和友老长沙龙虾馆",
                    "10": "1",
                    "stateName": "已开通",
                    "steelNumber": "434324422",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "DY080"
                }, {
                    "1": "2019-06-21 14:49:23",
                    "2": "71001",
                    "3": "863703031842698",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "400821",
                    "7": "0",
                    "8": "湖南省长沙市天心区文和友老长沙龙",
                    "9": "文和友老长沙龙虾馆",
                    "10": "863703031842698",
                    "stateCode": "1",
                    "stateName": "已开通",
                    "steelNumber": "180611042",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "BSS25-G40"
                }, {
                    "1": "2019-07-05 09:53:39",
                    "2": "10331",
                    "3": "212265464",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "199809",
                    "7": "0",
                    "8": "湖南省长沙市芙蓉区1",
                    "9": "文和友老长沙龙虾馆",
                    "10": "1",
                    "stateName": "已开通",
                    "steelNumber": "434324422",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "DY080"
                }, {
                    "1": "2019-06-21 14:49:23",
                    "2": "71001",
                    "3": "863703031842698",
                    "4": "0",
                    "5": "汉德史特",
                    "6": "400821",
                    "7": "0",
                    "8": "湖南省长沙市天心区文和友老长沙龙",
                    "9": "文和友老长沙龙虾馆",
                    "10": "863703031842698",
                    "stateCode": "1",
                    "stateName": "已开通",
                    "steelNumber": "180611042",
                    "telephone": "15612349052",
                    "totalMp": "0",
                    "totalMpName": "分表",
                    "versionName": "BSS25-G40"
                }],
                total: 26,
                state: {
                    code: 200,
                    description: "查询成功"
                }
            };
    }

}

var father_count = 0;

function getMenu() {
    father_count++;
    switch (father_count) {
        case 1:
            return [
                {
                    childCount: 7,
                    nodeChildren: [],
                    nodeId: "55123",
                    nodeName: "基础配置管理",
                    nodeUrl: ""
                },
                {
                    childCount: 2,
                    nodeChildren: [],
                    nodeId: "6453",
                    nodeName: "组织部门管理",
                    nodeUrl: ""
                }
            ];
        case 2:
            return [
                {
                    childCount: 6,
                    nodeChildren: [],
                    nodeId: "134",
                    nodeName: "管理系统",
                    nodeUrl: ""
                }
            ];
        default:
            return [
                {
                    childCount: 5,
                    nodeChildren: [],
                    nodeId: "143516",
                    nodeName: "xxxxxxxx",
                    nodeUrl: ""
                }
            ]
    }

}


var child_count = 0;

function getChildNode() {
    child_count++;
    switch (child_count) {
        case 1:
            return [
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "1",
                    nodeName: "用户管理",
                    nodeUrl: ""
                },
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "2",
                    nodeName: "菜单管理",
                    nodeUrl: ""
                }, {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "3",
                    nodeName: "职位授权",
                    nodeUrl: ""
                },
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "4",
                    nodeName: "权限组管理",
                    nodeUrl: ""
                },
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "5",
                    nodeName: "权限组类型管理",
                    nodeUrl: ""
                },
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "6",
                    nodeName: "数据字典",
                    nodeUrl: ""
                },
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "7",
                    nodeName: "操作日志",
                    nodeUrl: ""
                }
            ];
        case 6:
            return [
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "1",
                    nodeName: "部门管理",
                    nodeUrl: ""
                }
            ];
        case 2:
        case 4:
            return [
                {
                    childCount: 5,
                    nodeChildren: [],
                    nodeId: "6623",
                    nodeName: "运营管理系统",
                    nodeUrl: ""
                }, {
                    childCount: 4,
                    nodeChildren: [],
                    nodeId: "43215",
                    nodeName: "表计管理系统",
                    nodeUrl: ""
                }, {
                    childCount: 4,
                    nodeChildren: [],
                    nodeId: "14321",
                    nodeName: "工单管理系统",
                    nodeUrl: ""
                }, {
                    childCount: 6,
                    nodeChildren: [],
                    nodeId: "651",
                    nodeName: "资产管理系统",
                    nodeUrl: ""
                }, {
                    childCount: 3,
                    nodeChildren: [],
                    nodeId: "1",
                    nodeName: "设备管理系统",
                    nodeUrl: ""
                }
            ];
        case 5:
            return [
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "14325",
                    nodeName: "历史报表",
                    nodeUrl: ""
                }, {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "76548",
                    nodeName: "首页",
                    nodeUrl: ""
                }, {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "0576",
                    nodeName: "实时信息",
                    nodeUrl: ""
                }, {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "5423",
                    nodeName: "车间测试",
                    nodeUrl: ""
                }
            ];
        default:
            return [
                {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "2345432",
                    nodeName: "aaaaaaaaaa",
                    nodeUrl: ""
                }, {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "8964",
                    nodeName: "nnnnnnnnnnnnnn",
                    nodeUrl: ""
                }, {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "7654",
                    nodeName: "bbbbbbbbbbbbbb",
                    nodeUrl: ""
                }, {
                    childCount: 0,
                    nodeChildren: [],
                    nodeId: "13257647654",
                    nodeName: "cccccccccccccc",
                    nodeUrl: ""
                }
            ];
    }
}


function getParams() {
    var temp = {
        "areaId": "231500",
        "type": "5",
        "timeSet": [{
            "startTime": "2019-07-09 08:00:00",
            "endTime": "2019-07-09 20:00:00"
        }, {
            "startTime": "2019-07-09 20:00:00",
            "endTime": "2019-07-10 08:00:00"
        }]
    };
    return JSON.stringify(temp);
}

// function getModalTableResponse() {
//     return [{
//         "data": [{
//             "dataTime": "2019-07-10 07:00:00.0",
//             "id": "8185",
//             "name": "终止值",
//             "value": "10.044493"
//         }, {"dataTime": "2019-07-09 19:00:00.0", "id": "8184", "name": "起始值", "value": "10.044493"}, {
//             "id": "1196",
//             "name": "用量",
//             "value": "0.00"
//         }], "dataTime": "2019-07-09 19:00:00.0---2019-07-10 07:00:00.0", "pointId": "512930", "pointName": "嘉茂大酒店"
//     }, {
//         "data": [{
//             "dataTime": "2019-07-09 19:00:00.0",
//             "id": "8185",
//             "name": "终止值",
//             "value": "947.35693"
//         }, {"dataTime": "2019-07-09 07:00:00.0", "id": "8184", "name": "起始值", "value": "916.17694"}, {
//             "id": "1196",
//             "name": "用量",
//             "value": "31.18"
//         }],
//         "dataTime": "2019-07-09 07:00:00.0---2019-07-09 19:00:00.0",
//         "pointId": "367212",
//         "pointName": "国储实业有限公司（晓宇酒店）6楼平台"
//     }, {
//         "data": [{
//             "dataTime": "2019-07-10 07:00:00.0",
//             "id": "8185",
//             "name": "终止值",
//             "value": "972.82336"
//         }, {"dataTime": "2019-07-09 19:00:00.0", "id": "8184", "name": "起始值", "value": "947.35693"}, {
//             "id": "1196",
//             "name": "用量",
//             "value": "25.47"
//         }],
//         "dataTime": "2019-07-09 19:00:00.0---2019-07-10 07:00:00.0",
//         "pointId": "367212",
//         "pointName": "国储实业有限公司（晓宇酒店）6楼平台"
//     }, {
//         "data": [{
//             "dataTime": "2019-07-09 19:00:00.0",
//             "id": "8185",
//             "name": "终止值",
//             "value": "2457.695"
//         }, {"dataTime": "2019-07-09 07:00:00.0", "id": "8184", "name": "起始值", "value": "2385.2615"}, {
//             "id": "1196",
//             "name": "用量",
//             "value": "72.43"
//         }],
//         "dataTime": "2019-07-09 07:00:00.0---2019-07-09 19:00:00.0",
//         "pointId": "126501",
//         "pointName": "省纪委监察干部培训中心一楼新建锅炉房"
//     }, {
//         "data": [{
//             "dataTime": "2019-07-10 07:00:00.0",
//             "id": "8185",
//             "name": "终止值",
//             "value": "2457.695"
//         }, {"dataTime": "2019-07-09 19:00:00.0", "id": "8184", "name": "起始值", "value": "2457.695"}, {
//             "id": "1196",
//             "name": "用量",
//             "value": "0.00"
//         }],
//         "dataTime": "2019-07-09 19:00:00.0---2019-07-10 07:00:00.0",
//         "pointId": "126501",
//         "pointName": "省纪委监察干部培训中心一楼新建锅炉房"
//     }, {
//         "data": [{
//             "dataTime": "2019-07-09 18:00:00.0",
//             "id": "8185",
//             "name": "终止值",
//             "value": "4271.189"
//         }, {"dataTime": "2019-07-09 06:00:00.0", "id": "8184", "name": "起始值", "value": "4252.5493"}, {
//             "id": "1196",
//             "name": "用量",
//             "value": "18.64"
//         }],
//         "dataTime": "2019-07-09 06:00:00.0---2019-07-09 18:00:00.0",
//         "pointId": "891051",
//         "pointName": "上河国际G3栋(咭啡酒店)"
//     }, {
//         "data": [{
//             "dataTime": "2019-07-10 06:00:00.0",
//             "id": "8185",
//             "name": "终止值",
//             "value": "4303.798"
//         }, {"dataTime": "2019-07-09 18:00:00.0", "id": "8184", "name": "起始值", "value": "4271.189"}, {
//             "id": "1196",
//             "name": "用量",
//             "value": "32.61"
//         }],
//         "dataTime": "2019-07-09 18:00:00.0---2019-07-10 06:00:00.0",
//         "pointId": "891051",
//         "pointName": "上河国际G3栋(咭啡酒店)"
//     }, {
//         "data": [{
//             "dataTime": "2019-07-09 19:00:00.0",
//             "id": "8185",
//             "name": "终止值",
//             "value": "9.355528"
//         }, {"dataTime": "2019-07-09 07:00:00.0", "id": "8184", "name": "起始值", "value": "9.355528"}, {
//             "id": "1196",
//             "name": "用量",
//             "value": "0.00"
//         }], "dataTime": "2019-07-09 07:00:00.0---2019-07-09 19:00:00.0", "pointId": "650304", "pointName": "礼之道足浴五楼"
//     }, {
//         "data": [{
//             "dataTime": "2019-07-09 19:00:00.0",
//             "id": "8185",
//             "name": "终止值",
//             "value": "9.355528"
//         }, {"dataTime": "2019-07-09 07:00:00.0", "id": "8184", "name": "起始值", "value": "9.355528"}, {
//             "id": "1196",
//             "name": "用量",
//             "value": "0.00"
//         }], "dataTime": "2019-07-09 07:00:00.0---2019-07-09 19:00:00.0", "pointId": "650304", "pointName": "礼之道足浴五楼"
//     }];
// }

function getModalTableResponse() {
    return [{
        "data": [{
            "dataTime": "2",
            "id": "8185",
            "name": "终止值",
            "value": "10.044493"
        }, { "dataTime": "1", "id": "8184", "name": "起始值", "value": "10.044493" }, {
            "id": "1196",
            "name": "用量",
            "value": "0.00"
        }], "dataTime": "1---2", "pointId": "512930", "pointName": "酒店"
    }, {
        "data": [{
            "dataTime": "1",
            "id": "8185",
            "name": "终止值",
            "value": "947.35693"
        }, { "dataTime": "3", "id": "8184", "name": "起始值", "value": "916.17694" }, {
            "id": "1196",
            "name": "用量",
            "value": "31.18"
        }],
        "dataTime": "3---1",
        "pointId": "367212",
        "pointName": "酒店"
    }, {
        "data": [{
            "dataTime": "2",
            "id": "8185",
            "name": "终止值",
            "value": "972.82336"
        }, { "dataTime": "1", "id": "8184", "name": "起始值", "value": "947.35693" }, {
            "id": "1196",
            "name": "用量",
            "value": "25.47"
        }],
        "dataTime": "1---2",
        "pointId": "367212",
        "pointName": "酒店"
    }, {
        "data": [{
            "dataTime": "1",
            "id": "8185",
            "name": "终止值",
            "value": "2457.695"
        }, { "dataTime": "3", "id": "8184", "name": "起始值", "value": "2385.2615" }, {
            "id": "1196",
            "name": "用量",
            "value": "72.43"
        }],
        "dataTime": "3---1",
        "pointId": "126501",
        "pointName": "酒店"
    }, {
        "data": [{
            "dataTime": "2",
            "id": "8185",
            "name": "终止值",
            "value": "2457.695"
        }, { "dataTime": "1", "id": "8184", "name": "起始值", "value": "2457.695" }, {
            "id": "1196",
            "name": "用量",
            "value": "0.00"
        }],
        "dataTime": "1---2",
        "pointId": "126501",
        "pointName": "酒店"
    }, {
        "data": [{
            "dataTime": "2019-07-09 18:00:00.0",
            "id": "8185",
            "name": "终止值",
            "value": "4271.189"
        }, { "dataTime": "5", "id": "8184", "name": "起始值", "value": "4252.5493" }, {
            "id": "1196",
            "name": "用量",
            "value": "18.64"
        }],
        "dataTime": "5---6",
        "pointId": "891051",
        "pointName": "酒店"
    }, {
        "data": [{
            "dataTime": "6",
            "id": "8185",
            "name": "终止值",
            "value": "4303.798"
        }, { "dataTime": "7", "id": "8184", "name": "起始值", "value": "4271.189" }, {
            "id": "1196",
            "name": "用量",
            "value": "32.61"
        }],
        "dataTime": "7---8",
        "pointId": "891051",
        "pointName": "酒店"
    }, {
        "data": [{
            "dataTime": "1",
            "id": "8185",
            "name": "终止值",
            "value": "9.355528"
        }, { "dataTime": "3", "id": "8184", "name": "起始值", "value": "9.355528" }, {
            "id": "1196",
            "name": "用量",
            "value": "0.00"
        }], "dataTime": "3---1", "pointId": "650304", "pointName": "酒店"
    }, {
        "data": [{
            "dataTime": "1",
            "id": "8185",
            "name": "终止值",
            "value": "9.355528"
        }, { "dataTime": "3", "id": "8184", "name": "起始值", "value": "9.355528" }, {
            "id": "1196",
            "name": "用量",
            "value": "0.00"
        }], "dataTime": "3---1", "pointId": "650304", "pointName": "酒店"
    }];
}

function getColumns() {
    return [
        {
            field: '1',
            title: '序号'
        }, {
            field: '2',
            title: '物资名称'
        },
        {
            field: '3',
            title: '型号规格'
        }, {
            field: '4',
            title: '单位'
        }, {
            field: '5',
            title: '供应商'
        }, {
            field: '6',
            title: '可用数量'
        }, {
            field: '7',
            title: '锁定数量'
        }, {
            field: '8',
            title: '库存总数'
        }
    ]
}

function getScrollTableData() {
    return {
        data: [{
            "item": [{
                "id": "1",
                "value": "10001",
                "dataTime": "2019-07-09 18:00:00.0",
                "name": "终止值"
            }, {
                "id": "2",
                "value": "14561.783",
                "name": "起始值",
                "dataTime": "2019-07-09 06:00:00.0"
            }],
            "3": "621234",
            "4": "官方设定集",
            "5": "结果",
            "6": "高峰时段",
            "7": "胡胖子麓小院替代",
            "8": "2019-07-09"
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        },{
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "endendend",
            "2": "end",
            "3": "别3124321说话",
            "4": "621234",
            "5": "范德萨发生",
            "6": "范德萨",
            "7": "发生发的撒个",
            "8": "2019-07-09",
        }],
        total: 99,
        state: {
            code: 200,
            description: "查询成功"
        }
    }
}

function getExtendData(){
    return {
        data: [{
            "item": [{
                "id": "1",
                "value": "10001",
                "dataTime": "2019-07-09 18:00:00.0",
                "name": "终止值"
            }, {
                "id": "2",
                "value": "14561.783",
                "name": "起始值",
                "dataTime": "2019-07-09 06:00:00.0"
            }],
            "3": "621234",
            "4": "官方设定集",
            "5": "结果",
            "6": "高峰时段",
            "7": "胡胖子麓小院替代",
            "8": "2019-07-09"
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }, {
            "1": "10002",
            "2": "哈哈哈哈",
            "3": "别说话",
            "4": "621234",
            "5": "胡胖子麓小院替代",
            "6": "告诉对方",
            "7": "换个地方",
            "8": "2019-07-09",
        }],
        total: 99,
        state: {
            code: 200,
            description: "查询成功"
        }
    }
}